# Pandas

In [2]:
import pandas as pd
import numpy as np

## Series

In [3]:
etiquetas = ['a', 'b', 'c']
datos = [1,2,3]
pd.Series(data=datos, index=etiquetas)

a    1
b    2
c    3
dtype: int64

In [6]:
array = np.random.randint(0,6,4)
pd.Series(array)

0    2
1    4
2    0
3    1
dtype: int64

- En la celda anerior, la primer columna son los indices autogenerados y el la segunda el contenido de los datos. en la celda 3 le dimos tanto los indices com los datos

In [9]:
array = np.arange(20,23)
labels = ['venta1', 'venta2', 'venta3']
pd.Series(array, labels)

venta1    20
venta2    21
venta3    22
dtype: int64

- Para acceder a un valor especifico de la serie usamos la etiqueta o la posicion:

In [10]:
serie = pd.Series(array, labels)

In [11]:
serie['venta1']

20

In [12]:
serie[0]

20

- Los datos no deben ser necesariamente enteros, puede ser cualquier tipo

In [13]:
datos2 = [True, 10, 'hola', 10.24]
serie2 = pd.Series(datos2)

In [14]:
serie2

0     True
1       10
2     hola
3    10.24
dtype: object

- Puedo sumar dos series con la misma cantidad de datos, si son distintas, lo va a hacer, pero en el diferencial de cantidad les va a poner NaN como valor

In [18]:
s1 = pd.Series([1, 2, 3], ['v1', 'v2', 'v3'])
s2 = pd.Series([4,5,6], ['v1', 'v2', 'v3'])
s1+s2

v1    5
v2    7
v3    9
dtype: int64

In [20]:
s3 =pd.Series([1, 2, 3, 8], ['v1', 'v2', 'v3', 'v4'])
s1+s3

v1    2.0
v2    4.0
v3    6.0
v4    NaN
dtype: float64

# DataFrames

- Es una tabla con filas, columnas y valores

In [21]:
filas = ['v1', 'v2', 'v3']
cols = ['zona1', 'zona2', 'zona3']
datos = [[123, 456, 789],[345, 567, 765], [4, 56, 67]]
# Cada una de las listas dentro de datos sera una fila
df = pd.DataFrame(datos, filas, cols)
df

    zona1  zona2  zona3
v1    123    456    789
v2    345    567    765
v3      4     56     67

- Para conseguir todas las columnas de una fila:

In [32]:
df.loc['v1']

zona1    123
zona2    456
zona3    789
Name: v1, dtype: int64

- Para seleccionar varias filas --> df.loc[['v1','v2']]
- Si ademas quiero una sola columna de la fila seleccionada, agrego [] con el nombre de la columna o el indice de la misma

In [29]:
df.loc['v1']['zona1']

123

In [28]:
df.loc['v1'][0]

123

- Todo lo anterior sin el .loc funciona igual pero para el primer []

In [34]:
df['zona1']

v1    123
v2    345
v3      4
Name: zona1, dtype: int64

In [40]:
df[['zona1', 'zona3']]

    zona1  zona3
v1    123    789
v2    345    765
v3      4     67

- Agregar una columna mas

In [42]:
df['TodasLasZonas'] = df['zona1'] + df['zona2'] + df['zona3']
df

    zona1  zona2  zona3  TodasLasZonas
v1    123    456    789           1368
v2    345    567    765           1677
v3      4     56     67            127